In [7]:
import numpy as np
import pandas as pd

In [8]:
dict1={'Names':['Ramesh','Suresh',np.nan,"Mahesh"],'Age':[31,32,33,np.nan],
      'city':[np.nan,'Hyd','Mumbai','Chennai']}
#np.nan is missing value(in the xcel sheet you see empty spaces)

In [24]:
data1=pd.DataFrame(dict1)
data1

    Names   Age     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [18]:
data1.isnull()
# isnull() it is used to check whthere there is empty place or not

   Names    Age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [19]:
data1.isnull().sum()
#every column has one missing value is there

Names    1
Age      1
city     1
dtype: int64

In [20]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
city     0.25
dtype: float64

In [21]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
city     25.0
dtype: float64

In [22]:
dict2={'Names':['Ramesh','Suresh',None,"Mahesh"],'Age':[31,32,33,None],
      'city':[None,'Hyd','Mumbai','Chennai']}
data2=pd.DataFrame(dict2)
data2
# None

    Names   Age     city
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [12]:
data2.isnull()

   Names    Age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [23]:
data2.isnull().sum()

Names    1
Age      1
city     1
dtype: int64

In [29]:
dict3={'Names':['Ramesh','Suresh','Null',"Mahesh"],'Age':[31,32,33,'Null'],
      'city':['Null','Hyd','Mumbai','Chennai']}
data3=pd.DataFrame(dict3)
data3

    Names   Age     city
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

In [27]:
data3.isnull()

   Names    Age   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

** Method-1**
- Fill the missing values with random number
- dataframe name=data1
- method name: fillna

In [17]:
data1.fillna(40)

    Names   Age     city
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

** method-2 **
- filling in  a particular specific  column
- dataframe name: data1
- method: fillna

In [18]:
data1['Names'].fillna('Satish')

0    Ramesh
1    Suresh
2    Satish
3    Mahesh
Name: Names, dtype: object

In [19]:
data1['Names'].fillna('Satish',inplace=True)
data1

    Names   Age     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Satish  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [31]:
dict1={'Names':['Ramesh','Suresh',np.nan,"Mahesh"],'Age':[31,32,33,np.nan],
      'city':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

** Method-3**
- bfill
- ffill
- pad
- backfill

In [30]:
data1.fillna(method='backfill')
# Names index 2 is missing value, it will replace by index 3 value
# Age index 3 is missed value,we dont have index 4, so the value is NaN
# city index 0 has missed value, it replace with index 1

    Names   Age     city
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [34]:
data1.fillna(method='bfill')

    Names   Age     city
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [35]:
data1.fillna(method='ffill')

    Names   Age     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [36]:
data1.fillna(method='pad')

    Names   Age     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

- bfill , backfill are both same
- pad and ffill both are same

** Method-4 **
- Mean
- Median
- mode

In [37]:
data1

    Names   Age     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [22]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [23]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [ ]:
# instead of providing a random number
# we are filling with mean of the data

In [24]:
age_median=data1['Age'].median()
age_median

32.0

In [25]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [26]:
age_mode=data1['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [27]:
data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3     NaN
Name: Age, dtype: float64

In [ ]:
#level1: mean median mode
# level2: bfill fill
# level3: KNN imputer

# Method 5- KNN imputer

- KNN : k nearest neighbours
-    in the KNN imputer instead of taking mean of all the values
-    will choose neighbors data
-    will take those mean only

# n_neighbors is parameter can choose by user
# default value is 5

In [44]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [38]:
data1

    Names   Age     city
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

# method 6:
- based on other columns
- some times all above methods will not provide good justification
- at taht time we need to check other columns dependency also
- most of the time will pick a column  which have highest correlation

# Data transformation techniques